#Жители страны Малевии часто экспериментируют с планировкой комнат. Комнаты бывают треугольные, прямоугольные и круглые. 
#Чтобы быстро вычислять жилплощадь, требуется написать программу, на вход которой подаётся тип фигуры комнаты
#и соответствующие параметры, которая бы выводила площадь получившейся комнаты.
#Для числа π в стране Малевии используют значение 3.14.
n = str(input())
if n == 'треугольник':
    a = int(input())
    b = int(input())
    c = int(input())
    p = ((a + b + c) / 2)
    S = (float((p * (p - a) * (p - b) * (p - c))** 0.5))
    print(S)
elif n == 'прямоугольник':
    a = int(input())
    b = int(input())
    print(float(a * b))
elif n == 'круг':
    r = int(input())
    Pi = 3.14
    print(float(Pi * (r ** 2)))