#Узнав, что ДНК не является случайной строкой, только что поступившие в Институт биоинформатики студенты группы 
#информатиков предложили использовать алгоритм сжатия, который сжимает повторяющиеся символы в строке.

#Кодирование осуществляется следующим образом:
#s = 'aaaabbсaa' преобразуется в 'a4b2с1a2', 
#то есть группы одинаковых символов исходной строки заменяются на этот символ
#и количество его повторений в этой позиции строки.

#Напишите программу, которая считывает строку, кодирует её предложенным алгоритмом 
#и выводит закодированную последовательность на стандартный вывод. Кодирование должно учитывать регистр символов.
result = ""
counter = 0
string = input()
current = ""
total = 0
for i in string:
    total += 1
    if i == current:
        counter += 1
    else: 
        if counter != 0: 
            result += current + str(counter)
        current = i
        counter = 1
    if total == len(string):
        result += current + str(counter)
print(result)