#Напишите программу, на вход которой подаётся список чисел одной строкой. 
#Программа должна для каждого элемента этого списка вывести сумму двух его соседей. 
#Для элементов списка, являющихся крайними, одним из соседей считается элемент, находящий на противоположном конце этого списка.
#Например, если на вход подаётся список "1 3 5 6 10", то на выход ожидается список "13 6 9 15 7" (без кавычек).

#Если на вход пришло только одно число, надо вывести его же.

#Вывод должен содержать одну строку с числами нового списка, разделёнными пробелом.
string = input()
array = string.split()
result = ""
counter = 0
if len(array) == 1:
    result = array[0]
else: 
    for i in array:
        if counter == 0:
            x = int(array[1]) + int(array[-1])
        elif counter == len(array) - 1:
            x = int(array[-2]) + int(array[0])
        else:
            x = int(array[counter + 1]) + int(array[counter - 1])
        result += str(x) + " "
        counter += 1
print(result)