#Напишите программу, которая считывает список чисел lst из первой строки и число x из второй строки, 
#которая выводит все позиции, на которых встречается число xx в переданном списке lst.

#Позиции нумеруются с нуля, если число xx не встречается в списке, вывести строку "Отсутствует" 
#(без кавычек, с большой буквы).

#Позиции должны быть выведены в одну строку, по возрастанию абсолютного значения.
numbers = input()
lst = [int(x) for x in numbers.split()]
x = int(input())
counter = 0
result = ""
for i in lst:
    if i == x:
        result += str(counter) + " "
    counter += 1
if result == "":
    print("Отсутствует")
else:
    print(result)