#Напишите программу, которая в последовательности натуральных чисел определяет количество нечетных двухзначных чисел.
#Программа получает на вход натуральные числа, количество введенных чисел неизвестно, 
#последовательность чисел заканчивается числом 0 (0 - признак окончания ввода, не входит в последовательность).
#Количество чисел не превышает 1000. Введенные числа не превышают 30 000.
#Программа должна вывести одно число - количество нечетных двухзначных чисел во введенной последовательности.
counter = 0
number = ""
while number != 0:
    number = int(input())
    if number % 2 != 0 and 10 < number < 100:
        counter += 1
print(counter)