#Напишите программу, которая в последовательности целых чисел вычисляет сумму всех чисел, кратных 4 или 7. 
#Программа получает на вход целые числа, количество введённых чисел неизвестно, 
#последовательность чисел заканчивается числом 0 (0 – признак окончания ввода, не входит в последовательность).

#Количество чисел не превышает 1000. Введённые числа по модулю не превышают 1500.

#Программа должна вывести одно число: сумму всех чисел, кратных 4 или 7.
total = 0
number = ""
while number != 0:
    number = int(input())
    if number % 4 == 0 or number % 7 == 0:
        total += number
print(total)