#Напишите программу, которая в последовательности натуральных чисел вычисляет сумму всех двузначных чисел, кратных 6. 
#Программа получает на вход натуральные числа, количество введённых чисел неизвестно, последовательность чисел заканчивается числом 0 (0 – признак окончания ввода, не входит в последовательность).

#Количество чисел не превышает 1000. Введённые числа не превышают 1500.

#Программа должна вывести одно число: сумму всех двузначных чисел, кратных 6.
total = 0
number = ""
while number != 0:
    number = int(input())
    if number % 6 == 0 and 10 < number < 100:
        total += number
print(total)s