#Напишите программу, которая в последовательности натуральных чисел определяет максимальное число, кратное 5. 
#Программа получает на вход количество чисел в последовательности, а затем сами числа.
#В последовательности всегда имеется число, кратное 5.
#Количество чисел не превышает 1000. Введённые числа не превышают 30 000.
#Программа должна вывести одно число — максимальное число, кратное 5.
counter = int(input())
xmax = 0
for _ in range(counter):
    number = int(input())
    if number > xmax and number % 5 == 0:
        xmax = number
print(xmax)
