#Напишите программу, которая по двум данным натуральным числам a и b, не превосходящим 30000, 
#подсчитывает количество чётных натуральных чисел на отрезке [a, b] (включая концы отрезка). 
#Программа получает на вход два натуральных числа a и b, при этом гарантируется, что 1 ≤ a ≤ b ≤ 30000. 
#Проверять входные данные на корректность не нужно.
#Программа должна вывести одно число: количество чётных чисел на отрезке [a, b].
a = int(input())
b = int(input())
counter = 0
for i in range(a, b + 1):
    if i % 2 == 0:
        counter += 1
print(counter)