#Напишите программу, которая в последовательности натуральных чисел определяет минимальное число,
#кратное 3 и оканчивающееся на 4.
#Программа получает на вход количество чисел в последовательности, а затем сами числа. 
#В последовательности всегда имеется число, кратное 3.
#Количество чисел не превышает 1000. Введённые числа не превышают 30 000.
#Программа должна вывести одно число - минимальное число, кратное 3 и оканчивающееся на 4.
number = int(input())
xmin = 30000
for _ in range(number):
    a = int(input())
    if a < xmin and a % 3 == 0 and a % 10 == 4:
        xmin = a
print(xmin)