#Напишите программу, которая в последовательности натуральных чисел определяет максимальное число,
#оканчивающееся на 2 или на 8.
#Программа получает на вход количество чисел в последовательности, а затем сами числа.
#В последовательности всегда имеется число, оканчивающееся на 2 или на 8.
#Количество Чисел не превышает 1000. Введённые числа не превышают 30 000.
#Программа должна вывести одно число — максимальное число, оканчивающееся на 2 или на 8.
counter = int(input())
xmax = 0
for _ in range(counter):
    number = int(input())
    if number > xmax and (number % 10 == 2 or number % 10 == 8):
        xmax = number
print(xmax)