#Напишите программу, которая в последовательности натуральных чисел определяет сумму чётных чисел, не кратных 3.
#Программа получает на вход количество чисел в последовательности, а затем сами числа. 
#В последовательности всегда имеется чётное число, не кратное 3.
#Количество чисел не превышает 1000. Введённые числа не превышают 30 000.
#Программа должна вывести одно число - сумма чётных чисел, не кратных 3.
counter = int(input())
result = 0
for _ in range(counter):
    number = int(input())
    if number % 2 == 0 and number % 3 != 0:
        result += number
print(result)