#Напишите программу для решения следующей задачи.

#На зачётной работе по физике ученикам 9 класса было предложено 13 задач.
#Зачёт можно получить, если правильно решить не менее 7 задач.

#Сколько учеников получили зачёт? Вычислите среднее количество правильно решённых задач учащимися, получившими зачёт. 
#Гарантируется, что хотя бы один ученик сдал зачёт.

#Программа получает на вход количество учеников в классе N (1 ≤ N ≤ 15), 
#затем для каждого ученика вводится количество правильно решённых задач.
number = int(input())
counter = 0# 1 + 1 + 1
total = 0# 7 + 8 + 9
#7 6 8 6 9 
for _ in range(number):
    score = int(input())
    if score >= 7: 
        counter += 1
        total += score
print(counter)
print(total / counter)