#Напишите программу, которая в последовательности натуральных чисел вычисляет произведение
#всех нечетных двузначных или четырехзначных чисел, не кратных 5 и не оканчивающихся на 9. 
#Программа получает на вход натуральные числа, количество введённых чисел неизвестно,
#последовательность чисел заканчивается числом 0 (0 – признак окончания ввода, не входит в последовательность).
#Количество чисел не превышает 1000. Введённые числа не превышают 30 000.
#Программа должна вывести два значения в двух строках. 
#Первое значение: произведение всех нечетных двузначных или четырехзначных чисел, не кратных 5
#и не оканчивающихся на 9, или вывести «NO», если таких чисел нет. 
#Второе число: если есть хотя бы одно нечетное двузначное или четырехзначное число не кратное 5 и не оканчивающиеся на 9, 
#программа должна вывести второе число - минимальное число среди всех нечетных двузначных или четырехзначных чисел, 
#не кратных 5 и не оканчивающихся на 9. Если выведено «NO», то вывести вторым числом максимальное
#число среди всех введенных чисел в последовательности.
